<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [ ]:
!pip install sqlalchemy==1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3
con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
!pip install pandas

Requirement already satisfied: pandas in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.17.3 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from pandas) (1.21.6)
Requirement already satisfied: six>=1.5 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [9]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [4]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

**Note:This below code is added to remove blank rows from table**

In [7]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [8]:
query="""SELECT Launch_Site FROM SPACEXTABLE"""
pd.read_sql(query,con)

      Launch_Site
0     CCAFS LC-40
1     CCAFS LC-40
2     CCAFS LC-40
3     CCAFS LC-40
4     CCAFS LC-40
..            ...
96   CCAFS SLC-40
97     KSC LC-39A
98    VAFB SLC-4E
99   CCAFS SLC-40
100    KSC LC-39A

[101 rows x 1 columns]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [60]:
query="""SELECT * FROM SPACEXTABLE WHERE "Launch_Site" LIKE "CCA%" LIMIT 5"""
pd.read_sql(query,con)

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-10-08,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-03-01,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [19]:
query="""SELECT SUM(PAYLOAD_MASS__KG_) FROM SPACEXTABLE"""
pd.read_sql(query,con)

   SUM(PAYLOAD_MASS__KG_)
0                  619967

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [21]:
query="""SELECT AVG(PAYLOAD_MASS__KG_) FROM SPACEXTABLE WHERE Booster_Version='F9 v1.1'"""
pd.read_sql(query,con)

   AVG(PAYLOAD_MASS__KG_)
0                  2928.4

### Task 5

 List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [34]:
query="""SELECT MIN(Date) FROM (SELECT * FROM SPACEXTABLE WHERE Landing_Outcome LIKE '%Success%')"""
pd.read_sql(query,con)

    MIN(Date)
0  2015-12-22

### Task 6

 List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [35]:
query="""SELECT Booster_Version FROM SPACEXTABLE WHERE Landing_Outcome LIKE '%Success%' AND PAYLOAD_MASS__KG_>4000 AND PAYLOAD_MASS__KG_<6000"""
pd.read_sql(query,con)

   Booster_Version
0      F9 FT B1022
1      F9 FT B1026
2   F9 FT  B1021.2
3    F9 FT B1032.1
4    F9 B4 B1040.1
5   F9 FT  B1031.2
6    F9 B4 B1043.1
7    F9 B5 B1046.2
8    F9 B5 B1047.2
9    F9 B5 B1048.3
10  F9 B5 B1051.2
11    F9 B5B1060.1
12  F9 B5 B1058.2
13    F9 B5B1062.1

### Task 7




##### List the total number of successful and failure mission outcomes

In [39]:
query="""SELECT COUNT("Mission_Outcome") FROM SPACEXTABLE WHERE "Mission_Outcome" LIKE '%Success%'"""
pd.read_sql(query,con)

   COUNT("Mission_Outcome")
0                       100

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [44]:
query="""SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTABLE"""
pd.read_sql(query,con)

   MAX(PAYLOAD_MASS__KG_)
0                   15600

In [45]:
query="""SELECT Booster_Version FROM SPACEXTABLE WHERE PAYLOAD_MASS__KG_=15600"""
pd.read_sql(query,con)

   Booster_Version
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [49]:
query="""SELECT substr(Date, 6,2) AS month,Landing_Outcome,Booster_Version,Launch_Site FROM SPACEXTABLE WHERE substr(Date,0,5)='2015'"""
pd.read_sql(query,con)

  month         Landing_Outcome Booster_Version  Launch_Site
0    01    Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1    02      Controlled (ocean)   F9 v1.1 B1013  CCAFS LC-40
2    03              No attempt   F9 v1.1 B1014  CCAFS LC-40
3    04    Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40
4    04              No attempt   F9 v1.1 B1016  CCAFS LC-40
5    06  Precluded (drone ship)   F9 v1.1 B1018  CCAFS LC-40
6    12    Success (ground pad)     F9 FT B1019  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [58]:
query="""SELECT COUNT(Landing_Outcome),Landing_Outcome FROM SPACEXTABLE WHERE Date > '2010-06-04' AND Date < '2017-03-20' GROUP BY Landing_Outcome ORDER BY COUNT(Landing_Outcome) DESC """
pd.read_sql(query,con)

   COUNT(Landing_Outcome)         Landing_Outcome
0                      10              No attempt
1                       5    Success (drone ship)
2                       5    Failure (drone ship)
3                       3    Success (ground pad)
4                       3      Controlled (ocean)
5                       2    Uncontrolled (ocean)
6                       1  Precluded (drone ship)
7                       1     Failure (parachute)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>